export default [
  {
    title: 'Attributes',
    data: [
      {
        '参数': 'context',
        '说明': '右键菜单配置',
        '类型': 'Array',
        '可选值': '', 
        '默认值': '[]'
      }
    ]
  },
  {
    title: 'slots',
    data: [
      {
        '名称': 'header',
        '说明': '抽屉头部'
      },
      {
        '名称': 'body',
        '说明': '抽屉内容'
      },
      {
        '名称': 'header',
        '说明': '抽屉底部'
      }
    ]
  },
  {
    title: 'events',
    data: [
      {
        '名称': 'open',
        '说明': '打开抽屉',
        '回调函数': '-'
      },
      {
        '名称': 'close',
        '说明': '关闭抽屉',
        '回调函数': '-'
      },
      {
        '名称': 'closed',
        '说明': '抽屉关闭完毕后触发',
        '回调函数': '-'
      },
      {
        '名称': 'sumit',
        '说明': '点击确认时触发(show-footer为true)',
        '回调函数': '-'
      },
    ]
  }
]